task-last/task-c/openfoam/task-06/init_file/plate_base/0/U
FoamFile
{
    format ascii;
    class volVectorField;
    object U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.5 0 0);
boundaryField
{
    inlet { type fixedValue; value uniform (0.5 0 0); // TODO_INLET_VELOCITY
 }
    outlet { type zeroGradient; }
    top { type slip; }
    upstreamWall { type slip; }
    plate { type noSlip; }
    downstreamWall { type slip; }
    frontAndBack { type empty; }
}
